
# State **`s3://infrahouse-website-infra/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |    Destroy |
|----------:|---------:|------------:|-----------:|
|        ✅ |        2 |           2 |          0 |
## Affected resources by action

|  Action  | Resources                                                     |
|:--------:|:--------------------------------------------------------------|
|    🟢    | `module.website.aws_route53_record.extra_caa_amazon[0]`       |
|    🟢    | `module.website.aws_route53_record.extra_caa_amazon[1]`       |
|    🟡    | `module.website.aws_alb.website`                              |
|    🟡    | `module.website.module.instance_profile.aws_iam_role.profile` |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.website.aws_alb.website will be updated in-place
  ~ resource "aws_alb" "website" {
        id                                                           = "arn:aws:elasticloadbalancing:us-west-1:493370826424:loadbalancer/app/web20240913214119018400000001/899a5c5d81f7169f"
        name                                                         = "web20240913214119018400000001"
      ~ tags                                                         = {
            "VantaContainsEPHI"        = "false"
            "VantaContainsUserData"    = "false"
            "VantaNonProd"             = "false"
            "access_log_bucket"        = "web-access-log-20240930132736922900000001"
            "access_log_bucket_policy" = "web-access-log-20240930132736922900000001"
            "account"                  = "493370826424"
            "created_by_module"        = "infrahouse/website-pod/aws"
            "environment"              = "production"
          ~ "module_version"           = "5.4.1" -> "5.8.2"
            "service"                  = "website"
        }
      ~ tags_all                                                     = {
          ~ "module_version"           = "5.4.1" -> "5.8.2"
            # (10 unchanged elements hidden)
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.website.aws_route53_record.extra_caa_amazon[0] will be created
  + resource "aws_route53_record" "extra_caa_amazon" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "infrahouse.com"
      + records         = [
          + "0 issue \"amazon.com\"",
          + "0 issuewild \";\"",
        ]
      + ttl             = 300
      + type            = "CAA"
      + zone_id         = "Z07662251LH3YRF2ERM3G"
    }

  # module.website.aws_route53_record.extra_caa_amazon[1] will be created
  + resource "aws_route53_record" "extra_caa_amazon" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www.infrahouse.com"
      + records         = [
          + "0 issue \"amazon.com\"",
          + "0 issuewild \";\"",
        ]
      + ttl             = 300
      + type            = "CAA"
      + zone_id         = "Z07662251LH3YRF2ERM3G"
    }

  # module.website.module.instance_profile.aws_iam_role.profile will be updated in-place
  ~ resource "aws_iam_role" "profile" {
        id                    = "website-instance-ligu2fkfx1fy20240913200526365700000001"
        name                  = "website-instance-ligu2fkfx1fy20240913200526365700000001"
      ~ tags                  = {
            "VantaContainsEPHI"     = "false"
            "VantaContainsUserData" = "false"
            "VantaNonProd"          = "false"
            "account"               = "493370826424"
            "created_by_module"     = "infrahouse/instance-profile/aws"
            "environment"           = "production"
          ~ "module_version"        = "1.8.1" -> "1.9.0"
            "service"               = "website"
            "upstream_module"       = "infrahouse/website-pod/aws"
        }
      ~ tags_all              = {
          ~ "module_version"        = "1.8.1" -> "1.9.0"
            # (9 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS90ZXJyYWZvcm0udGZzdGF0ZSI6IHsic3VjY2VzcyI6IHRydWUsICJhZGQiOiAyLCAiY2hhbmdlIjogMiwgImRlc3Ryb3kiOiAwfX0=
```
</details>